#include <iostream>

using namespace std;

int test()
{
	int n, x, y;
	int a[7];
	int u[4] = { 0,5,3,1 };
	while (1)
	{
		cin >> a[1] >> a[2] >> a[3] >> a[4] >> a[5] >> a[6];
		if (a[1] == 0 && a[2] == 0 && a[3] == 0 && a[4] == 0 && a[5] == 0 && a[6] == 0)
			break;

		n = a[4] + a[5] + a[6] + (a[3] + 3) / 4;	// 装入所有 3*3、 4*4、 5*5、 6*6 需要n个包裹
		
		y = 5 * a[4] + u[a[3] % 4];					// 在现有包裹中，还能插入y个2*2的
		if (a[2] > y)
			n += (a[2] - y + 8) / 9;				// 有多余的2*2，需要另外增加包裹
		
		x = 36 * n - 36 * a[6] - 25 * a[5] - 16 * a[4] - 9 * a[3] - 4 * a[2];	// 在现有包裹中，还能插入x个1*1的 
		if (a[1] > x)
			n += (a[1] - x + 35) / 36;				// 有多余的1*1，需要另外增加包裹
		
		cout << n << endl;
	}
	return 0;
}
